	IDENTIFICATION DIVISION.
	PROGRAM-ID. IDEONE.

	ENVIRONMENT DIVISION.

	DATA DIVISION.
		WORKING-STORAGE SECTION.
	 	01 WORD PIC X(30).
	PROCEDURE DIVISION.
	*>	your code goes here
		
		PERFORM TRY-IF.
			
		STOP-NOW.
			STOP RUN.
					
		TRY-IF.
			ACCEPT WORD.
			
				
			IF WORD > "CHACKALACA"
			DISPLAY "CHACALACA IS HIGHER IN ALPHABET"
			ELSE
			DISPLAY "CHACALACA IS LOWER IN ALPHABET".