	IDENTIFICATION DIVISION.
	PROGRAM-ID. IDEONE.

	ENVIRONMENT DIVISION.

	DATA DIVISION.
		WORKING-STORAGE SECTION.
	 	01 YES-NOT PIC X.
	PROCEDURE DIVISION.
	*>	your code goes here
		
		PERFORM TRY-IF.
			
		STOP-NOW.
			STOP RUN.
					
		TRY-IF.
			ACCEPT YES-NOT.
			DISPLAY YES-NOT.
			
			IF YES-NOT = "y"
				MOVE "Y" TO YES-NOT.
			IF YES-NOT = "n"
				MOVE "N" TO YES-NOT.
				
			IF YES-NOT = "Y"
				DISPLAY "YES"
			ELSE
				DISPLAY "NO".
					